views/site/sections/_equipment.php

SELECT * FROM `equipment` ORDER BY `id`
SELECT * FROM `equipment`
SELECT * FROM `equipment_component`
---
    'depends' => [\yii\web\JqueryAsset::className()],
]);

$equipment = Equipment::find()->orderBy(['id' => SORT_ASC])->all();
$equipments = Equipment::find()->all();
$components = EquipmentComponent::find()->all();