views/site/sections/_portfolio.php

                                $counter = 0;

                                $productItems = count($product_category);
                                $itemsproduct = FicProduct::find()->where(['is_public' => 1])->count();
---
SELECT COUNT(*) FROM `fic_product` WHERE `is_public`=1