views/site/sections/_services.php



                                $totalItems = count($tech_category);
                                $items = FicTechService::find()->where(['is_public' => 1])->count();
---
SELECT COUNT(*) FROM `fic_tech_service` WHERE `is_public`=1