controllers/SiteController.php

SELECT * FROM `tech_service`
SELECT * FROM `product`
SELECT * FROM `fic_product`
SELECT COUNT(*) FROM `fic_tech_service`
SELECT * FROM `fic_tech_service` WHERE `is_public`=1 ORDER BY `id` DESC LIMIT 4
---
    public function actionIndex()
    {
        $inquire = new Inquiry();
        // $ficListing = FIC::getFics();
        $tech_category = TechService::find()->all();
        $product_category = Product::find()->all();
        $ficProduct = FicProduct::find()->all();

        $query = FicTechService::find();
        $count = $query->count();
        $pages = new Pagination(
            [
                'totalCount' => $count,
                'pageSize' => 6
            ]
        );

        $techservices = FicTechService::find()
            ->where(['is_public' => 1]) // Filter by is_public status
            ->orderBy(['id' => SORT_DESC])
            ->limit(4) // Limit the number of results to 4
            ->all();

SELECT * FROM `product` WHERE `id`='49'
---
    public function actionProductInquiry()
    {
        $request = Yii::$app->request;
        $model = new Inquiry();
        $productId = $request->get('productId');
        $product = Product::findOne($productId);