models/FicSns.php

    public static function getFicSns()
    {
        return self::find()->all();
---
SELECT * FROM `fic_sns`