models/Product.php

    public static function getProducts()
    {
        return self::find()->all();
---
SELECT * FROM `product`