models/TechService.php

SELECT * FROM `tech_service`
---
    public static function getServices()
    {
        return self::find()->all();